[
    {
        "id": 87264,
        "banner_img": "https://i.ibb.co/dpjL8vB/lf.webp",
        "comment_number": 42,
        "like": 128,
        "book_name": "Of THEE I SING",
        "post": "Barack Obama's book offers readers a poignant and insightful journey through his life and political career. With eloquence and candor, Obama invites readers into his world, sharing personal anecdotes, political triumphs, and the challenges he faced along the way. One of the book's strengths lies in its ability to transcend mere autobiography; it serves as a reflection on the broader themes of leadership, democracy, and the American Dream. Obama's writing style is engaging, striking a balance between introspection and policy analysis, making the book accessible to readers of all backgrounds.Throughout the pages, Obama's unwaver.",
        "date": "4 month"
    },
    {
        "id": 33591,
        "banner_img": "https://i.ibb.co/9ZxmnCk/image-327.webp",
        "comment_number": 56,
        "like": 92,
        "book_name": "Gitanjali",
        "post": "Rabindranath Tagore's 'Gitanjali' is a timeless masterpiece that resonates with readers across cultures and generations. Originally written in Bengali and later translated into English, 'Gitanjali' captures the essence of human spirituality and the universal quest for divine connection.Rabindranath Tagore's 'Gitanjali' is a timeless masterpiece that resonates with readers across cultures and generations. Originally written in Bengali and later translated into English, 'Gitanjali' captures the essence of human spirituality and the universal quest for divine connection.Throughout the pages of 'Gitanjali,' Tagore celebrates the divine presence in everyday moments – in the beauty of nature, the kindness of strangers, and the depths of the human heart. His words have a transformative power, inspiring readers to cultivate a deeper sense of gratitude, compassion, and inner peace.",
        "date": "7 days"
    },
    {
        "id": 52178,
        "banner_img": "https://i.ibb.co/8s6QhDV/images-2.jpg",
        "comment_number": 25,
        "like": 37,
        "book_name": "The World History",
        "post": "The World History offers an expansive and captivating exploration of humanity's collective past, from the earliest civilizations to the modern era. Authored by esteemed historians, this comprehensive tome serves as an indispensable guide for anyone seeking to understand the complex tapestry of human history.One of the book's greatest strengths lies in its scope and depth. Covering a wide range of geographical regions and historical periods, The World History provides readers with a nuanced understanding of the interconnectedness of global events and civilizations. From the rise and fall of empires to the social, cultural, and economic transformations that have shaped societies throughout history, the book leaves no stone unturned.",
        "date" : "1 year"
        
    },
    {
        "id": 94623,
        "banner_img": "https://i.ibb.co/kGx9BZ4/3869-UX160.jpg",
        "comment_number": 82,
        "like": 205,
        "book_name": "A Brief History",
        "post": "A Brief History of Time by renowned physicist Stephen Hawking is a captivating exploration of the universe, its origins, and its ultimate fate. Through a masterful blend of scientific insight and accessible prose, Hawking invites readers on a journey through the cosmos, unraveling the mysteries of space, time, and the fundamental laws of physics.One of the book's most remarkable qualities is its ability to distill complex scientific concepts into language that is easily understandable for the layperson. Hawking's gift for clear and concise explanation allows readers of all backgrounds to grasp the profound implications of concepts such as the Big Bang, black holes, and the nature of time itself. Whether discussing the curvature of space-time or the enigmatic behavior of subatomic particles, Hawking's explanations are both enlightening and engaging.",
        "date" : "9 days"
    },
    {
        "id": 20745,
        "banner_img": "https://i.ibb.co/891tBrt/book7.jpg",
        "comment_number": 33,
        "like": 67,
        "book_name": "Bible",
        "post": "The Bible stands as one of the most influential and enduring books in human history, revered by millions around the world as a sacred text and a source of spiritual guidance. Comprising diverse literary genres, including poetry, prose, history, and prophecy, this ancient anthology offers readers a window into the beliefs, traditions, and values of numerous cultures and civilizations.One of the Bible's greatest strengths lies in its universal appeal. Across centuries and continents, people of diverse faiths and backgrounds have turned to its pages for solace, wisdom, and inspiration. Whether exploring the moral teachings of Jesus in the New Testament or pondering the wisdom literature of the Old Testament, readers of all faiths can find resonance in the timeless truths and enduring themes of love, compassion, justice, and redemption.",
        "date" : "3 years"
    }
]